## Terraform Plan Results

#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_firewall.this will be created
  + resource "hcloud_firewall" "this" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "dbd-25-firewall"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
      + rule {
          + destination_ips = []
          + direction       = "out"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (2 unchanged attributes hidden)
        }
      + rule {
          + destination_ips = []
          + direction       = "out"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
      + rule {
          + destination_ips = []
          + direction       = "out"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # hcloud_server.this will be created
  + resource "hcloud_server" "this" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = "fsn1-dc14"
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-24.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = (known after apply)
      + name                       = "dbd-25-node"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx23"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "ali-pc-1",
          + "ali-laptop",
          + "forke@DESKTOP-68BLBQK",
          + "ali-pc-2",
          + "github actions",
        ]
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @AliHMohammad, Action: `pull_request`, Workflow: `Pull request`*